{
    "blogs": [
        {
            "title": "First Blog Post!",
            "link": "/first-blog-post",
            "date": "2024-09-11",
            "intro": "Welcome to my very first blog post on my portfolio!",
            "text1": "This space is meant for showcasing smaller projects or personal musings that don't warrant a whole case study but are short and sweet. Writing can be a powerful tool for organizing one's thoughts, so hopefully, by writing down my reflections, I'll be able to untangle my mind a bit.",
            "text2": "In addition to project updates, I'll be sharing reflections on various topics related to design, technology, and anything else that interests me. Whether it's the latest trends in ux, emerging technologies, or cute animal pictures, I hope to provide some interesting and engaging content. This portfolio is my digital home and I hope you have fun exploring it. feel free to connect with me on LinkedIn or reach out over email",
            "end": "Stay tuned for more blog posts. I won't be keeping to any set schedule but will aim to write whenever I discover something new, interesting, or complete a new project. Thank you for taking the time to read my first blog post. Make sure to watch this space 😎"
        },
        {
            "title": "Moo Deng Posting",
            "link": "/moo-deng-posting",
            "date": "2024-09-11",
            "intro": "Moo Deng - The cutest Thai pygmy hippo from Khao Kheow Zoo!",
            "text1": "This 2-month old pygmy hippo has been all over my feed and I wanted to show this cutie to the masses.",
            "text2": "",
            "end": "I hope these pictures have lifted your spirits as much as they did mine.",
            "img1": "https://pbs.twimg.com/media/GXDO9TCXcAE5Z6t?format=jpg&name=large",
            "img2": "https://pbs.twimg.com/media/GXEicHKbEAMON5A.jpg"
        },
        {
            "title": "Recipes and Cocktails",
            "link": "/recipes-and-cocktails",
            "date": "2024-09-16",
            "intro": "In this post, I want to showcase two recent projects that I've completed: DrinkPedia, an app that fetches cocktails from TheCockTailDB, and Recipefetcher, a simple app that fetches recipes from TheMealDB",
            "text1": "RecipeFetcher was a school assignment I completed in March of this year. Built using TheMealDB API and Material UI, it was one of the first React web applications I created. The goal was to design a user-friendly app where users can search for recipes and filter by categories, making meal planning much easier. The experience taught me the fundamentals of API integration, state management, and responsive UI design. It was an eye-opening introduction to the power of React and Material UI, both of which I continue to use in my development workflow today.",
            "text2": "DrinkPedia, on the other hand, was a personal project I took on in July. I wanted to build something fun while also leveling up my skills. DrinkPedia fetches data from TheCocktailDB and was built using Chakra UI, a React component library that I found to be more flexible for custom UI needs. This project was a significant milestone for me because I was able to apply everything I had learned from RecipeFetcher while also experimenting with the design much more.",
            "end": "It’s been rewarding to see how far I’ve come in such a short time, from working on a school project to building something entirely on my own. With RecipeFetcher, I focused heavily on following best practices and following the assignment. But with DrinkPedia, I had more freedom to design and architect the application the way I wanted. Both projects can be found on my GitHub link in nav.",
            "img1":"https://raw.githubusercontent.com/sarahthebest/Recipefetcher/main/thumbnail.png",
            "img2":"/img/drinkPediaPreview.gif"
        }
    ]
}
